{
    "_class_name": "UNet2DConditionModel_New",
    "_diffusers_version": "0.6.0",
    "act_fn": "silu",
    "attention_head_dim": 8,
    "block_out_channels": [
      320,
      640,
      1280,
      1280
    ],
    "center_input_sample": false,
    "cross_attention_dim": 768,
    "down_block_types": [
      "CrossAttnDownBlock2D_New",
      "CrossAttnDownBlock2D_New",
      "CrossAttnDownBlock2D_New",
      "DownBlock2D"
    ],
    "downsample_padding": 1,
    "flip_sin_to_cos": true,
    "freq_shift": 0,
    "in_channels": 4,
    "layers_per_block": 2,
    "mid_block_scale_factor": 1,
    "norm_eps": 1e-05,
    "norm_num_groups": 32,
    "out_channels": 4,
    "sample_size": 64,
    "up_block_types": [
      "UpBlock2D",
      "CrossAttnUpBlock2D_New",
      "CrossAttnUpBlock2D_New",
      "CrossAttnUpBlock2D_New"
    ]
  }